LCS_Testcases/LCS_Testcase_cylinder_smallLCSMesh/constant/LCS/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

/*
      7------6
     /|     /|
    3------2 |
    | |    | | 
    | 4----|-5  y 
    |/     |/   |__x
    0------1    /
               z
*/

vertices
(
    (-10 -10 -0.5)  //0
    (30 -10 -0.5)   //1
    (30 10 -0.5)    //2
    (-10 10 -0.5)   //3
    (-10 -10 0.5)   //4
    (30 -10 0.5)    //5
    (30 10 0.5)     //6
    (-10 10 0.5)    //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (400 320 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    out
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );

    }

    sym1
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
        
    sym2
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }

    in
    {
        type patch;
        faces
        (
            (0 4 7 3)
        ); 
    }

    back 
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }

    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
