LCS_Testcases/LCS_Testcase_cylinder_smallLCSMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    out
    {
        type            patch;
        nFaces          80;
        startFace       18180;
    }
    sym1
    {
        type            symmetryPlane;
        nFaces          100;
        startFace       18260;
    }
    sym2
    {
        type            symmetryPlane;
        nFaces          100;
        startFace       18360;
    }
    in
    {
        type            patch;
        nFaces          80;
        startFace       18460;
    }
    cylinder
    {
        type            wall;
        nFaces          80;
        startFace       18540;
    }
    back
    {
        type            empty;
        nFaces          9200;
        startFace       18620;
    }
    front
    {
        type            empty;
        nFaces          9200;
        startFace       27820;
    }
)


// ************************************************************************* //
