LCS_Testcases/LCS_Testcase_cylinder_smallLCSMesh/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
     volScalarFieldValue cellDist 0
);

regions
(
    boxToCell
    {
        box (-20 -20 -0.5) (5 20 0.5);

        fieldValues
        (
            volScalarFieldValue cellDist 1
        );
    }
);


// ************************************************************************* //
